

//Samskrutham database
var halanth = "्"
var anuswara = "ं"
var visarga = "ः"
var samyukta = "््"
var chandrabindu = "ँ"
var swaraMatra = new Map([
    [ 'अ',' ' ],
    [ 'आ','ा' ],
    [ 'इ','ि' ],
    [ 'ई','ी' ],
    [ 'उ','ु' ],
    [ 'ऊ','ू' ],
    [ 'ऋ','ृ' ],
    [ 'ॠ','ॄ' ],
    [ 'ऌ','ॢ' ],
    [ 'ॡ','ॣ' ],
    [ 'ए','े' ],
    [ 'ऐ','ै' ],
    [ 'ओ','ो' ],
    [ 'औ','ौ' ],
    [ 'अं', '\u0902' ],
    [ 'अः','\u0903' ]
])


let matraSwara = new Map([...swaraMatra.entries()].map(
  ([key, value]) => ([value, key]))
);

var swara = [ 'अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ऋ', 'ऌ', 'ए', 'ऐ', 'ओ', 'औ' ]
var vyanjan = [ 
                'क', 'ख', 'ग', 'घ', 'ङ', 
                'च', 'छ', 'ज', 'झ', 'ञ', 
                'ट', 'ठ', 'ड', 'ढ', 'ण', 
                'त', 'थ', 'द', 'ध', 'न', 
                'प', 'फ', 'ब', 'भ', 'म', 
                'य', 'र', 'ल', 'व', 'श', 'ष', 'स', 'ह'
               ];
var sankya = [ '०', '१', '२', '३', '४', '५', '६', '७', '८', '९' ]


var linga = [ 'पुलिंग','सत्रिलिंग','नपुंसकलिंग' ]

//Sabdhamanjari
var vibhakthis =

  [
       {
          shabdam: "",
          suffix: "",
          lingam: "",
          meaning: "",
          vibhakti: {
              prathama: ['', '', ''],
              sambhodana: ['', '', ''],
              dvitiya: ['', '', ''],
              trutiya: ['', '', ''],
              chaturthi: ['', '', ''],
              panchami: ['', '', ''],
              shasti: ['', '', ''],
              saptami: ['', '', ''],
          }
      },


      {
          shabdam: "राम",
          suffix: "अ",
          lingam: "पुलिंग",
          meaning: "రాముడు",
          vibhakti: {
              prathama: [ 'रामः', 'रामौ', 'रामाः' ],
              sambhodana: [ 'हे रामः', 'हे रामौ', 'हे रामा' ],
              dvitiya: [ 'रामम्', 'रामौ', 'रामान्' ],
              trutiya: [ 'रामेण', 'रामाभ्याम्', 'रामैः' ],
              chaturthi: [ 'रामाय', 'रामाभ्याम्', 'रामेभ्यः' ],
              panchami: [ 'रामात्', 'रामाभ्याम्', 'रामेभ्यः' ],
              shasti: [ 'रामस्य', 'रामयोः', 'रामाणाम्' ],
              saptami: [ 'रामे', 'रामयोः', 'रामेशु' ],
          }
      },


      {
          shabdam: "हरि",
          suffix: "इ",
          lingam: "पुलिंग",
          meaning: "విష్నువు",
          vibhakti: {
              prathama: [ 'हरिः','हरी','हरयः' ],
              sambhodana: [ 'हे हरे','हे हरी','हे हरयः' ],
              dvitiya: [ 'हरिम्','हरी','हरीन्' ],
              trutiya: [ 'हरिणा','हरिभ्याम्','हरिभिः' ],
              chaturthi: [ 'हरये','हरिभ्याम्','हरिभ्यः' ],
              panchami: [ 'हरेः','हरिभ्याम्','हरिभ्यः' ],
              shasti: [ 'हरेः','हर्यौः','हरिणाम्' ],
              saptami: [ 'हरौ','हर्योः','हरिषु' ],
          }
      },

      {
          shabdam: "शंभु",
          suffix: "उ",
          lingam: "पुलिंग",
          meaning: "శివుడు",
          vibhakti: {
              prathama: [ 'शंभु','शंभू','शंभवः' ],
              sambhodana: [ 'हे शंभो','हे शंभू','हे शंभवः' ],
              dvitiya: [ 'शंभुम्','शंभू','शंभून्' ],
              trutiya: [ 'शंभुना','शंभुभ्याम्','शंभुभिः' ],
              chaturthi: [ 'शंभवे','शंभुभ्याम्','शंभुभ्यः' ],
              panchami: [ 'शंभो','शंभुभ्याम्','शंभुभ्यः' ],
              shasti: [ 'शंभोः','शंभ्वोः','शंभुनाम्' ],
              saptami: [ 'शंभौ','शंभ्वोः','शंभुशु' ],
          }
      },
  ]


